#+title: Queries
#+PROPERTY: header-args :engine postgresql
#+PROPERTY: header-args+ :dbhost localhost
#+PROPERTY: header-args+ :dport 5432
#+PROPERTY: header-args+ :dbuser ebissoli
#+PROPERTY: header-args+ :database cinema

* Cinema queries
    Quantos cinemas existem no db que comecam com os dois primeiros digitos do cnpj entre 30-50?
   #+begin_src sql
    SELECT COUNT(1)
           FROM CINEMA AS c
           WHERE c.cnpj ~ '^3\d|^4\d|^50'
   #+end_src

   #+RESULTS:
   | count |
   |-------|
   |     3 |

   Quantos cinemas terminam o numero de telefone com o mesmo digito?
  #+begin_src sql
    CREATE FUNCTION endPhoneDig(endnum integer)
           RETURNS varchar(14) -- digito de phone final
           LANGUAGE plpgsql
        AS
    $$
    DECLARE
        dig varchar(14);
    BEGIN
        SELECT cont_tele
        INTO dig
               FROM CINEMA AS c
               WHERE c.cont_tele ~ ($1 || '$');

        RETURN dig;
    END;
    $$;

  #+end_src

  #+RESULTS:
  | CREATE FUNCTION |
  |-----------------|

 #+begin_src sql
DROP FUNCTION endPhoneDig
 #+end_src

 #+RESULTS:
 | DROP FUNCTION |
 |---------------|

 #+begin_src sql
    SELECT * FROM endPhoneDig('4');
 #+end_src

 #+RESULTS:
 |---|

update email based on business rule
#+begin_src sql
UPDATE CINEMA AS c -- setar emailpadrao para contas especificas
       SET end_num = '9999', cont_email = 'cinema.default.@gmail.com'
        WHERE c.cnpj ~ '^4\d';
SELECT cont_email, end_num
        FROM CINEMA;
#+end_src

#+RESULTS:
| UPDATE 0   |         |
|------------+---------|
| cont_email | end_num |

#+begin_src sql
DELETE
       FROM CINEMA AS c;
            WHERE c.end_cep ~ '7$';
SELECT end_cep
         FROM CINEMA
#+end_src

#+RESULTS:
| DELETE 0 |
|----------|

#+begin_src sql
SELECT end_num
       FROM CINEMA AS c
            WHERE cast(c.end_num as varchar(18)) ~ '^6'; -- casting feature
#+end_src

#+RESULTS:
| end_num |
|---------|
|    6665 |
|    6693 |
|    6440 |
|    6400 |
|    6740 |
|    6665 |
|    6566 |

#+begin_src sql
SELECT COUNT(1)
       FROM CINEMA AS c
            WHERE c.cont_email ~ 'apple.com$';
#+end_src

#+RESULTS:
| count |
|-------|
|     2 |

#+begin_src sql
SELECT DISTINCT cont_tele -- unique phone numbers
        FROM CINEMA AS c
#+end_src

#+RESULTS:
|    cont_tele |
|--------------|
| +81941111010 |
| +81918889258 |
| +81966115634 |
| +81932063896 |
| +81976766884 |
| +81973747382 |
| +81986333488 |
| +81960496512 |
| +81919189118 |
| +81921111745 |
| +81999989118 |
| +81957501125 |
| +81919889158 |
| +81995676688 |
| +81907000000 |
| +81923363132 |
| +81946333488 |
| +81932038964 |
| +81981754729 |
| +81929859031 |
| +81941210109 |
| +81995353394 |
| +81966676688 |
| +81940661730 |
| +81967459643 |
| +81953755256 |
| +81936118583 |
| +81919989158 |
| +81975117560 |
| +81900000000 |

#+begin_src sql
SELECT cnpj, cont_email -- projection of two fields
       FROM CINEMA AS c LIMIT 10;
#+end_src

#+RESULTS:
| cnpj              | cont_email                      |
|-------------------+---------------------------------|
| 20.244.470/291-43 | cinema.perez-stokes@apple.com   |
| 56.364.755/741-96 | cinema.chandler@baidu.com       |
| 22.717.803/901-18 | cinema.powell@gmail.com         |
| 08.445.373/381-68 | cinema.reynolds@gmail.com       |
| 83.638.636/221-83 | cinema.bush@gmail.com           |
| 26.111.438/081-43 | cinema.wheeler@moz.com          |
| 61.759.847/271-40 | cinema.valenzuela@buzz.com      |
| 96.971.866/191-25 | cinema.smith@baidu.com          |
| 55.459.555/401-85 | cinema.hall@buzz.com            |
| 37.373.353/391-53 | cinema.shepherd-allen@gmail.com |

Fazer query que diz maior end_num
#+begin_src sql
SELECT MAX(end_num), c.cnpj
        FROM CINEMA AS c
        GROUP BY c.cnpj -- find for the group thing, so for the specified field, what is the max? Because field is PK this makes no sense
#+end_src

#+RESULTS:
|  max | cnpj              |
|------+-------------------|
| 4444 | 38.991.414/871-20 |
| 9999 | 81.671.482/931-78 |
| 9932 | 12.999.149/461-45 |
| 8874 | 26.111.438/081-43 |
| 6665 | 22.717.803/901-18 |
| 6566 | 72.286.957/151-06 |
| 3233 | 33.494.659/661-52 |
| 5763 | 08.559.055/001-54 |
| 7766 | 98.311.622/481-47 |
| 9108 | 00.000.000/001-00 |
| 5808 | 44.648.396/801-58 |
| 6665 | 89.596.554/081-51 |
| 4443 | 47.179.929/771-74 |
| 1811 | 55.459.555/401-85 |
| 6693 | 08.445.373/381-68 |
| 5595 | 96.971.866/191-25 |
| 6440 | 61.759.847/271-40 |
| 3353 | 43.668.636/521-49 |
| 2322 | 83.638.636/221-83 |
| 7799 | 20.244.470/291-43 |
| 7777 | 56.364.755/741-96 |
|    0 | 69.963.638/641-28 |
| 7328 | 38.791.414/871-20 |
| 6400 | 29.725.191/811-76 |
| 5665 | 69.495.156/191-60 |
| 8881 | 37.373.353/391-53 |
| 5544 | 89.522.601/481-41 |
| 4442 | 14.276.977/121-35 |
| 6740 | 67.621.268/471-81 |
| 7676 | 48.179.729/731-34 |

#+begin_src sql
SELECT end_num -- filter above
        FROM CINEMA AS c
        WHERE c.end_num > 300 LIMIT 10;
#+end_src

#+RESULTS:
| end_num |
|---------|
|    7799 |
|    7777 |
|    6665 |
|    6693 |
|    2322 |
|    8874 |
|    6440 |
|    5595 |
|    1811 |
|    8881 |

#+begin_src sql
SELECT end_num
       FROM CINEMA AS c
       WHERE c.end_num BETWEEN 4000 AND 7000 LIMIT 10;
#+end_src

#+RESULTS:
| end_num |
|---------|
|    6665 |
|    6693 |
|    6440 |
|    5595 |
|    4442 |
|    4444 |
|    5665 |
|    6400 |
|    6740 |
|    5544 |

#+begin_src sql
SELECT *
        FROM CINEMA AS c
        WHERE c.end_num in (7777, 6665) LIMIT 10;
#+end_src

#+begin_src sql
SELECT *
       FROM CINEMA AS c
       WHERE c.cont_email ~ 'perez.+com$|perez.+info$' LIMIT 10; -- find by regexp
#+end_src
#+RESULTS:
| cnpj              |   end_cep | end_num | cont_email                    |    cont_tele | nome                |
|-------------------+-----------+---------+-------------------------------+--------------+---------------------|
| 20.244.470/291-43 | 19938-911 |    7799 | cinema.perez-stokes@apple.com | +81975117560 | Cinema Perez-Stokes |

#+begin_src sql
SELECT *
       FROM CINEMA AS c
       WHERE c.cont_tele IS NULL OR end_num = '7799' LIMIT 10;
#+end_src

#+RESULTS:
| cnpj              |   end_cep | end_num | cont_email                    |    cont_tele | nome                |
|-------------------+-----------+---------+-------------------------------+--------------+---------------------|
| 20.244.470/291-43 | 19938-911 |    7799 | cinema.perez-stokes@apple.com | +81975117560 | Cinema Perez-Stokes |


#+begin_src sql
-- CREATE VIEW upper_naming AS
-- SELECT cont_email
--         FROM CINEMA AS c;
UPDATE upper_naming
    SET cont_email = upper(cont_email);
SELECT cont_email
        FROM CINEMA AS c; -- create view to no alter default data

#+end_src

#+RESULTS:
| UPDATE 30                        |
|----------------------------------|
| cont_email                       |
| CINEMA.PEREZ-STOKES@APPLE.COM    |
| CINEMA.CHANDLER@BAIDU.COM        |
| CINEMA.POWELL@GMAIL.COM          |
| CINEMA.REYNOLDS@GMAIL.COM        |
| CINEMA.BUSH@GMAIL.COM            |
| CINEMA.WHEELER@MOZ.COM           |
| CINEMA.VALENZUELA@BUZZ.COM       |
| CINEMA.SMITH@BAIDU.COM           |
| CINEMA.HALL@BUZZ.COM             |
| CINEMA.SHEPHERD-ALLEN@GMAIL.COM  |
| CINEMA.CLARK-HAYNES@GMAIL.COM    |
| CINEMA.LEWIS@OUTLOOK.INFO        |
| CINEMA.WILLIAMS@APPLE.INFO       |
| CINEMA.BOWMAN-ROSS@MOZ.COM       |
| CINEMA.FREY@GMAIL.COM            |
| CINEMA.RAMSEY@OUTLOOK.COM        |
| CINEMA.ODONNELL@MOZ.COM          |
| CINEMA.LEWIS@APPLE.COM           |
| CINEMA.GONZALES@BUZZ.COM         |
| CINEMA.BROWN@OUTLOOK.ORG         |
| CINEMA.DOMINGUEZ-EVANS@BUZZ.NET  |
| CINEMA.SMITH-LANG@GMAIL.BIZ      |
| CINEMA.YANG@MOZ.COM              |
| CINEMA.CAIN@APPLE.ORG            |
| CINEMA.WATSON-SMITH@BAIDU.NET    |
| CINEMA.GOLDEN@OUTLOOK.COM        |
| CINEMA.GRIFFIN-GUZMAN@GMAIL.INFO |
| CINEMA.MONTES@BAIDU.COM          |
| CINEMA.FRAZIER@OUTLOOK.COM       |
| CINEMA.GALLAGHER@BUZZ.COM        |

* Sala queries

* Sessao queries

* Filme queries

* Genero queries

* Ingresso queries

* Consumivel queries

* Cliente queries

* Cupom queries

* Compra_ing queries

* Comra_consu queries

* SQL transactions hook
